import json
import re,math
import requests
from urllib import parse
from SXR.get_conn import MyMysqlClient


with open('GB2312汉字.txt', 'r') as f:
    words = f.read()

def get_words():
    print('连接数据库')
    db = MyMysqlClient()
    wordTuple = db.get_word()
    wordList = [d for w in wordTuple for d in w]
    print(wordList)
    return wordList
# BJX = ['赵', '钱', '孙', '李', '周', '吴', '郑', '王', '冯', '陈', '褚', '卫', '蒋', '沈', '韩', '杨',
#        '朱', '秦', '尤', '许', '何', '吕', '施', '张', '孔', '曹', '严', '华', '金', '魏', '陶', '姜',
#        '戚', '谢', '邹', '喻', '柏', '水', '窦', '章', '云', '苏', '潘', '葛', '奚', '范', '彭', '郎',
#        '鲁', '韦', '昌', '马', '苗', '凤', '花', '方', '俞', '任', '袁', '柳', '酆', '鲍', '史', '唐',
#        '费', '廉', '岑', '薛', '雷', '贺', '倪', '汤', '滕', '殷', '罗', '毕', '郝', '邬', '安', '常',
#        '乐', '于', '时', '傅', '皮', '卞', '齐', '康', '伍', '余', '元', '卜', '顾', '孟', '平', '黄',
#        '和', '穆', '萧', '尹', '姚', '邵', '湛', '汪', '祁', '毛', '禹', '狄', '米', '贝', '明', '臧',
#        '计', '伏', '成', '戴', '谈', '宋', '茅', '庞', '高', '夏', '蔡', '田', '樊', '胡', '凌', '霍',
#        '虞', '万', '支', '柯', '昝', '管', '卢', '莫', '经', '房', '裘', '缪', '干', '解', '应', '宗',
#        '丁', '宣', '贲', '邓', '郁', '单', '杭', '洪', '包', '诸', '左', '石', '崔', '吉', '钮', '龚',
#        '程', '嵇', '邢', '滑', '裴', '陆', '荣', '翁', '荀', '羊', '於', '惠', '甄', '曲', '家', '封',
#        '宁', '仇', '栾', '暴', '甘', '钭', '厉', '戎', '祖', '武', '符', '刘', '景', '詹', '束', '龙',
#        '叶', '幸', '司', '韶', '郜', '黎', '蓟', '薄', '印', '宿', '白', '怀', '蒲', '邰', '从', '鄂',
#        '索', '咸', '籍', '赖', '卓', '蔺', '屠', '蒙', '池', '乔', '阴', '鬱', '胥', '能', '苍', '双',
#        '闻', '莘', '党', '翟', '谭', '贡', '劳', '逄', '姬', '申', '扶', '堵', '冉', '宰', '郦', '雍',
#        '郤', '璩', '桑', '桂', '濮', '牛', '寿', '通', '边', '扈', '燕', '冀', '郏', '浦', '尚', '农',
#        '温', '别', '庄', '晏', '柴', '瞿', '阎', '充', '慕', '连', '茹', '习', '宦', '艾', '鱼', '容',
#        '向', '古', '易', '慎', '戈', '廖', '庾', '终', '暨', '居', '衡', '步', '都', '耿', '满', '弘',
#        '匡', '国', '文', '寇', '广', '禄', '阙', '东', '欧', '殳', '沃', '利', '蔚', '越', '夔', '隆',
#        '师', '巩', '厍', '聂', '晁', '勾(句)', '敖', '融','冷', '訾', '辛', '阚', '那', '简', '饶', '空',
#        '曾', '毋', '沙', '乜', '养', '鞠', '须', '丰','巢', '关', '蒯', '相', '查', '后', '荆', '红',
#        '游', '竺', '权', '逯', '盖', '益', '桓', '公','万俟', '司马', '上官', '欧阳', '夏侯', '诸葛',
#        '闻人', '东方', '赫连', '皇甫', '尉迟', '公羊','澹台', '公冶', '宗政', '濮阳', '淳于', '单于',
#        '太叔', '申屠', '公孙', '仲孙', '轩辕', '令狐','钟离', '宇文', '长孙', '慕容', '鲜于', '闾丘',
#        '司徒', '司空', '丌官', '司寇', '仉', '督', '子车','颛孙', '端木', '巫马', '公西', '漆雕', '乐正',
#        '壤驷', '公良', '拓跋', '夹谷', '宰父', '谷梁','晋', '楚', '闫', '法', '汝', '鄢', '涂', '钦',
#        '段干', '百里', '东郭', '南门', '呼延', '归','海', '羊舌', '微生', '岳', '帅', '缑', '亢',
#        '况', '郈', '有', '琴', '梁丘', '左丘', '东门','西门', '商', '牟', '佘', '佴', '伯', '赏', '南宫',
#        '墨', '哈', '谯', '笪', '年', '爱', '阳', '佟', '第五', '言', '福']
def get_page():
    '''
    获取每个关键字对应结果的页数
    :return:
    '''
    # for x in ['赵']:
    for word in ['啊','阿','谁','呵']:
        if word not in get_words():
            print('关键字%s开始爬取'%word)
            url = 'https://sp0.baidu.com/8aQDcjqpAAV3otqbppnN2DJv/api.php?resource_id=6899&' \
                  'query=%E5%A4%B1%E4%BF%A1%E8%A2%AB%E6%89%A7%E8%A1%8C%E4%BA%BA%E5%90%8D%E5%8D%95&' \
                  'cardNum=&iname='+parse.quote(word)+'&areaName=&ie=utf-8&oe=utf-8&format=json&' \
                  't=1544577115451&cb=jQuery110204664755153341853_1544402912660&_=1544402913265'
            headers = {
                'Accept': '*/*',
                'Connection': 'keep-alive',
                'Host': 'sp0.baidu.com',
                'Referer': 'https://www.baidu.com/s?ie=utf-8&f=8&rsv_bp=0&rsv_idx=1&tn=92495750_hao_pg&wd=%E5%A4%B1%E4%BF%A1%E4%BA%BA&'
                           'rsv_pq=a7fd7e6400019288&rsv_t=62cfttvGmYTkabqLarrpEkV9w%2FOt11rbAGfmEkmOcbShE9krvXVR6tYF9l%2FBh1ZAuyCa8mx3&'
                           'rqlang=cn&rsv_enter=1&rsv_sug3=8&rsv_sug2=0&inputT=1289&rsv_sug4=1290'
            }
            response = requests.get(url,headers=headers).text
            p = re.compile(r'[(](.*)[)]', re.S)
            datas = re.findall(p, response)
            data = json.loads(datas[0])
            try:
                total = int(data['data'][0]['listNum'])
                # page = (total + 10 -1)//50
                page = math.ceil(float(total)/50)
                # print(total,page)
                result = {}
                result.update({word:page})
                print(result)
                yield result
            except IndexError:
                pass
        else:
            print('关键字%s已爬取' % word)
            continue
